In [6]:
# It is used to do data selection task on pandas dataframe
import pandas as pd
import numpy as np

data = pd.DataFrame({
    'city' : ['Jaipur' , 'pondicherry' ,'bangalore' , 'Jabalpur'],
    'name' : ['Nikita' , 'Riya' , 'Nitisha' , 'Ashi'],
    'section' : ['A' , 'B' , 'C' , 'D'],
    'age' : [29 , 22 , 32 , 24] 
})
data

          city     name section  age
0       Jaipur   Nikita       A   29
1  pondicherry     Riya       B   22
2    bangalore  Nitisha       C   32
3     Jabalpur     Ashi       D   24

In [7]:
print(data.loc[data.age >= 25])

        city     name section  age
0     Jaipur   Nikita       A   29
2  bangalore  Nitisha       C   32

In [12]:
print(data.loc[(data.age >=25) & (data.city == 'bangalore')])

        city     name section  age
2  bangalore  Nitisha       C   32

In [13]:
data.at[2 , 'city'] = 'Bangalore'

In [14]:
data

          city     name section  age
0       Jaipur   Nikita       A   29
1  pondicherry     Riya       B   22
2    Bangalore  Nitisha       C   32
3     Jabalpur     Ashi       D   24

In [15]:
data.at[1 , 'city'] = 'Puducherry'

In [16]:
data

         city     name section  age
0      Jaipur   Nikita       A   29
1  Puducherry     Riya       B   22
2   Bangalore  Nitisha       C   32
3    Jabalpur     Ashi       D   24

In [17]:
print(data.loc[1:2])

         city     name section  age
1  Puducherry     Riya       B   22
2   Bangalore  Nitisha       C   32

In [18]:
# using iloc
print(data.iloc[[0 , 2]])

        city     name section  age
0     Jaipur   Nikita       A   29
2  Bangalore  Nitisha       C   32

In [22]:
print(data.iloc[[0 , 3] , [0 , 1]])

       city    name
0    Jaipur  Nikita
3  Jabalpur    Ashi